nyankowan/CatchRobo_2026/STM32/robomas_controller/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "arm.h"
#include "can_protocol.h"
#include "coordinate.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_can.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm_can.h"
#include <math.h>
#include <stdint.h>
#include <string.h>
#include <stdbool.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct
{
    uint16_t angle_raw;

    int32_t total_angle;

    int16_t rpm;
    int16_t current;
    uint8_t temperature;

    uint16_t last_angle; //to calc total_angle

    uint32_t last_update; // 最後に受信した時間 HAL_GetTick()

    bool initialized; //初回ロボマスフィードバックを受けたか
} robomas_feedback_t;

/**
* @param double p;   比例ゲイン 
* @param double i;   積分ゲイン
* @param double d;   微分ゲイン
* @param double mv;  manipulated value 操作量
* @param double sv;  set value 目標値
* @param double it;  integral term 積分項 偏差の総和
* @param double pe;  previous error 直前の偏差
* @param double pv;  process value 制御量 フィードバック
* @param uint32_t last_update;   最後に更新した時間 HAL_GetTick()
**/
typedef struct{
  double p;   //比例ゲイン
  double i;   //積分ゲイン
  double d;   //微分ゲイン
  double mv;  //manipulated value 操作量
  double sv;  //set value 目標値
  double it;  //integral term 積分項 偏差の総和
  double pe;  //previous error 直前の偏差
  double pv;  //process value 制御量 フィードバック
  uint32_t last_update;  // 最後に更新した時間 HAL_GetTick()
}pid_t;

/**
* @param ROBOMAS_INITAL, // 何もトルクを送らない状態
* @param ROBOMAS_HOMING, // 速度制御によって，リミットスイッチ位置まで回転する
* @param ROBOMAS_IDLE,   // ホーミング終了による他のホーミングを待機
* @param ROBOMAS_READY,  // ユーザが制御可能な状態
* @param ROBOMAS_ERROR,  // フィードバックを受け取れず，制御不能な状態
 */
typedef enum{
  ROBOMAS_INITIAL,  // 初回起動時状態
  ROBOMAS_HOMING,   // 速度制御によって，リミットスイッチ位置まで回転する
  ROBOMAS_IDLE,     // ホーミング終了による他のホーミングを待機
  ROBOMAS_READY,    // ユーザが制御可能な状態
  ROBOMAS_ERROR,    // 制御不能状態
}robomas_state_t;

/**
* @param robomas_feedback_t feedback
* @param pid_t rpm_pid   モーターrpmの制御 
* @param pid_t ang_pid   モーター角(resolution 8192)の制御 
* @param robomas_state_t state     ロボマス制御状態
* @param in32_t total_angle_home 極座標の原点に対応するモーター角(一周あたりの解像度 8192)
* @param int16_t tx_torque     ロボマスへ送るトルク値
* @param double gear_ratio    遊星軸/モーター軸 ギア比
*/
typedef struct{
  robomas_feedback_t feedback;
  pid_t rpm_pid;  //モーターrpmの制御
  pid_t ang_pid;  //モーター角(resolution 8192)の制御
  robomas_state_t state;
  int32_t total_angle_home;//極座標の原点に対応するモーター角(一周あたりの解像度 8192)
  int16_t tx_torque;
  double gear_ratio;  // 遊星軸/モーター軸 ギア比

}robomas_t;

uint32_t upper_homing_start_time;
uint32_t lower_homing_start_time;

//(HOMING -> HOMING_ACK -> ... -> HOMING_DONE -> HOMING_DONE_ACK)
can_sequence_t upper_homing_sequence;
can_sequence_t lower_homing_sequence;

bool upper_homing_done_ack_pending; // HOMING_DONEを送信し，HOMING_DONE_ACK待ちかどうか
bool lower_homing_done_ack_pending;
uint32_t upper_homing_done_sent_time;
uint32_t lower_homing_done_sent_time;
uint8_t upper_homing_done_retry_count;
uint8_t lower_homing_done_retry_count;

// 一度のホーミング試行につき，タイムアウトのCAN_ID_ERROR_CODEは1回しか送らない
bool upper_homing_timeout_notified;
bool lower_homing_timeout_notified;

#define HOMING_DONE_ACK_RETRY_MS 200   //この間隔でHOMING_DONEを再送する
#define HOMING_DONE_ACK_MAX_RETRY 5    //再送を諦めるまでの回数

// Status_LED点滅パターン用
// lowerがREADYでない:+1 upperがREADYでない:+2 (両方でないなら3回点滅) 両方READYなら常時点灯
#define STATUS_LED_BLINK_ON_MS   150
#define STATUS_LED_BLINK_OFF_MS  150
#define STATUS_LED_BLINK_PAUSE_MS 700
uint8_t status_led_blink_index; //現在の点滅サイクルで何回点滅したか
bool status_led_on;
uint32_t status_led_phase_start;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define LOOP_MS 2
#define ROBOMAS_FEEDBACK_TIMEOUT_MS 100

#define ROBOMAS_NUM 4

#define ROBOMAS_MAX_TORQUE 16384 //ロボマスに送れる最大電流値
#define ROBOMAS_M3_GEAR_RATIO (3591.0 / 187.0)//M3508
#define ROBOMAS_M2_GEAR_RATIO 36              //M2006
#define ROBOMAS_ANGLE_RESOLUTION 8192 //0〜8191

// ROBOT_TEAM(出場チーム 青/赤)はcommon/arm/inc/arm.hで定義される。
// ESP32/STM32の全ファームウェアで共有する値なので，このファイルでは再定義しない。

//上下でロボマスの取り付け向きが逆なため，R軸と同様にDEG軸も上下で別定数にして符号を反転する
//(この符号は配線・機構で決まる固定値で，チームによっては変わらない)
#define LOWER_ARM_DEG_ROBOMAS_DIRECTION 1 //上から見て半時計回りが正でモーターは右ねじを正とするとき
#define UPPER_ARM_DEG_ROBOMAS_DIRECTION -1
#define LOWER_ARM_R_ROBOMAS_DIRECTION 1 //アームが伸びる方向が正でモーター右ねじ正
#define UPPER_ARM_R_ROBOMAS_DIRECTION -1


//ToDo: pullupしているので，導通したらRESET，していないならSETになる．リミットスイッチの接続によって変える．
//      リミットスイッチ：COM NO NC の三つのコネクタがあり，COMは常に接続されている．NOはスイッチを押すと導通，NCはスイッチを離すと導通．
#define LOWER_ARM_DEG_UNDER_LIMIT_ON (HAL_GPIO_ReadPin(LOWER_ARM_DEG_UNDER_LIMIT_GPIO_Port, LOWER_ARM_DEG_UNDER_LIMIT_Pin) == GPIO_PIN_RESET)
#define LOWER_ARM_DEG_UNDER_LIMIT_OFF !LOWER_ARM_DEG_UNDER_LIMIT_ON
#define LOWER_ARM_DEG_OVER_LIMIT_ON (HAL_GPIO_ReadPin(LOWER_ARM_DEG_OVER_LIMIT_GPIO_Port, LOWER_ARM_DEG_OVER_LIMIT_Pin) == GPIO_PIN_RESET)

#define LOWER_ARM_R_LIMIT_ON (HAL_GPIO_ReadPin(LOWER_ARM_R_LIMIT_GPIO_Port, LOWER_ARM_R_LIMIT_Pin) == GPIO_PIN_RESET)
#define LOWER_ARM_R_LIMIT_OFF !LOWER_ARM_R_LIMIT_ON

#define UPPER_ARM_DEG_UNDER_LIMIT_ON (HAL_GPIO_ReadPin(UPPER_ARM_DEG_UNDER_LIMIT_GPIO_Port, UPPER_ARM_DEG_UNDER_LIMIT_Pin) == GPIO_PIN_RESET)
#define UPPER_ARM_DEG_UNDER_LIMIT_OFF !UPPER_ARM_DEG_UNDER_LIMIT_ON
#define UPPER_ARM_DEG_OVER_LIMIT_ON (HAL_GPIO_ReadPin(UPPER_ARM_DEG_OVER_LIMIT_GPIO_Port, UPPER_ARM_DEG_OVER_LIMIT_Pin) == GPIO_PIN_RESET)

#define UPPER_ARM_R_LIMIT_ON (HAL_GPIO_ReadPin(UPPER_ARM_R_LIMIT_GPIO_Port, UPPER_ARM_R_LIMIT_Pin) == GPIO_PIN_RESET)
#define UPPER_ARM_R_LIMIT_OFF !UPPER_ARM_R_LIMIT_ON

// 赤/青チームはフィールドが鏡合わせのため整理機構を左右逆側に付け替える必要があり，
// それに合わせてDEG軸(偏角)をどちら側の可動端(リミットスイッチ)を原点として
// ホーミングするかを切り替える(LOWER/UPPER_ARM_DEG_HOME_DEGはcommon/arm/inc/arm.h参照)。
// 赤チーム: 可動域下限(_DEG_UNDER_LIMIT，整理機構は左)へ向けてホーミングする(従来通り)。
// 青チーム: 可動域上限(_DEG_OVER_LIMIT，整理機構は右)へ向けてホーミングする。
// ホーミング回転方向は，原点にする側へ実際に向かうよう符号(*_DEG_HOMING_DIRECTION_SIGN)を
// 反転させる。DEG_ROBOMAS_DIRECTION(配線で決まる固定値)自体は変えない。
#if ROBOT_TEAM == ROBOT_TEAM_BLUE
#define LOWER_ARM_DEG_HOMING_LIMIT_ON LOWER_ARM_DEG_OVER_LIMIT_ON
#define UPPER_ARM_DEG_HOMING_LIMIT_ON UPPER_ARM_DEG_OVER_LIMIT_ON
#define LOWER_ARM_DEG_HOMING_DIRECTION_SIGN 1
#define UPPER_ARM_DEG_HOMING_DIRECTION_SIGN 1
#else
#define LOWER_ARM_DEG_HOMING_LIMIT_ON LOWER_ARM_DEG_UNDER_LIMIT_ON
#define UPPER_ARM_DEG_HOMING_LIMIT_ON UPPER_ARM_DEG_UNDER_LIMIT_ON
#define LOWER_ARM_DEG_HOMING_DIRECTION_SIGN (-1)
#define UPPER_ARM_DEG_HOMING_DIRECTION_SIGN (-1)
#endif

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan1;
CAN_HandleTypeDef hcan2;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
direct_t coordinate[ARM_NUM] = {LOWER_ARM_HOME_COORDINATE, UPPER_ARM_HOME_COORDINATE};
#define coordinate_lower coordinate[0]
#define coordinate_upper coordinate[1]

robomas_t robomas[ROBOMAS_NUM] = {
  { .state = ROBOMAS_INITIAL,
    .gear_ratio = ROBOMAS_M3_GEAR_RATIO,
    .rpm_pid = {
    .p = 10, .i = 0, .d = 0,
  }, .ang_pid = {
    .p = 0.1, .i = 0, .d = 0,
  }},
  { .state = ROBOMAS_INITIAL,
    .gear_ratio = ROBOMAS_M3_GEAR_RATIO,
    .rpm_pid = {
    .p = 10, .i = 0, .d = 0,
  }, .ang_pid = {
    .p = 0.1, .i = 0, .d = 0,
  }},
  { .state = ROBOMAS_INITIAL,
    .gear_ratio = ROBOMAS_M3_GEAR_RATIO,
    .rpm_pid = {
    .p = 10, .i = 0, .d = 0,
  }, .ang_pid = {
    .p = 0.1, .i = 0, .d = 0,
  }},
  { .state = ROBOMAS_INITIAL,
    .gear_ratio = ROBOMAS_M3_GEAR_RATIO,
    .rpm_pid = {
    .p = 10, .i = 0, .d = 0,
  }, .ang_pid = {
    .p = 0.1, .i = 0, .d = 0,
  }},
};
#define robomas_lower_deg robomas[0]
#define robomas_lower_r robomas[1]
#define robomas_upper_deg robomas[2]
#define robomas_upper_r robomas[3]
/* USER CODE END PV */

