nyankowan/CatchRobo_2026/STM32/robomas_controller/Core/Src/main.c
/*in main roop begin*/
void upper_homing(){
  // HOMING_DONEを送信済みでHOMING_DONE_ACK待ちの場合，一定時間ごとに再送する
  if(upper_homing_done_ack_pending &&
     HAL_GetTick() - upper_homing_done_sent_time > HOMING_DONE_ACK_RETRY_MS){
    if(upper_homing_done_retry_count < HOMING_DONE_ACK_MAX_RETRY){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_UPPER_HOMING_DONE,
        .data.homing_sequence = upper_homing_sequence,
      });
      upper_homing_done_sent_time = HAL_GetTick();
      upper_homing_done_retry_count++;
    }else{
      upper_homing_done_ack_pending = false; //諦める
    }
  }

  if(robomas_upper_r.state == ROBOMAS_READY && robomas_upper_deg.state == ROBOMAS_READY)return;

  if(!upper_homing_timeout_notified &&
     (robomas_upper_deg.state == ROBOMAS_HOMING || robomas_upper_deg.state == ROBOMAS_IDLE ||
      robomas_upper_r.state   == ROBOMAS_HOMING || robomas_upper_r.state   == ROBOMAS_IDLE) &&
     HAL_GetTick() - upper_homing_start_time > HOMING_UPPER_ARM_TIMEOUT_MS){
    // ROBOMAS_ERROR中の軸はrobomas_update()が管理するのでここでは触らない
    if(robomas_upper_deg.state != ROBOMAS_ERROR)robomas_upper_deg.state = ROBOMAS_INITIAL;
    if(robomas_upper_r.state   != ROBOMAS_ERROR)robomas_upper_r.state   = ROBOMAS_INITIAL;

    upper_homing_timeout_notified = true;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_ERROR_CODE,
      .data.error_code = CAN_ERROR_UPPER_HOMING_TIMEOUT,
    });
  }

  if(robomas_upper_deg.state == ROBOMAS_HOMING && UPPER_ARM_DEG_HOMING_LIMIT_ON){
    robomas_upper_deg.state = ROBOMAS_IDLE;
    // 原点となる偏角はUPPER_ARM_DEG_HOME_DEG(チームに応じてUNDER/OVERどちらの
    // リミットスイッチかで変わる。common/arm/inc/arm.h参照)。R軸のUPPER_ARM_R_MINオフセットと
    // 同様に，set_robomas_deg_from_coordinate()がtheta=0基準で計算するsvと辻褄が合うよう，
    // ここでtheta=UPPER_ARM_DEG_HOME_DEG分のオフセットをtotal_angle_homeへ焼き込む。
    robomas_upper_deg.total_angle_home = robomas_upper_deg.feedback.total_angle
      - UPPER_ARM_DEG_ROBOMAS_DIRECTION * (UPPER_ARM_DEG_HOME_DEG / 360.0) * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION * robomas_upper_deg.gear_ratio;
    pid_reset(&robomas_upper_deg.rpm_pid);
  }
    
  if(robomas_upper_r.state == ROBOMAS_HOMING && UPPER_ARM_R_LIMIT_ON){
    robomas_upper_r.state = ROBOMAS_IDLE;
    robomas_upper_r.total_angle_home = robomas_upper_r.feedback.total_angle - UPPER_ARM_R_ROBOMAS_DIRECTION * UPPER_ARM_R_MIN / (R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION;
    pid_reset(&robomas_upper_r.rpm_pid);
  }

  if(robomas_upper_r.state == ROBOMAS_IDLE && robomas_upper_deg.state == ROBOMAS_IDLE){
    pid_reset(&robomas_upper_r.ang_pid);
    pid_reset(&robomas_upper_deg.ang_pid);
    
    robomas_upper_r.state = ROBOMAS_READY;
    robomas_upper_deg.state = ROBOMAS_READY;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_UPPER_HOMING_DONE,
      .data.homing_sequence = upper_homing_sequence,
    });
    upper_homing_done_ack_pending = true;
    upper_homing_done_sent_time = HAL_GetTick();
    upper_homing_done_retry_count = 0;
    return;
  }
}

void lower_homing(){
  // HOMING_DONEを送信済みでHOMING_DONE_ACK待ちの場合，一定時間ごとに再送する
  if(lower_homing_done_ack_pending &&
     HAL_GetTick() - lower_homing_done_sent_time > HOMING_DONE_ACK_RETRY_MS){
    if(lower_homing_done_retry_count < HOMING_DONE_ACK_MAX_RETRY){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_LOWER_HOMING_DONE,
        .data.homing_sequence = lower_homing_sequence,
      });
      lower_homing_done_sent_time = HAL_GetTick();
      lower_homing_done_retry_count++;
    }else{
      lower_homing_done_ack_pending = false; //諦める
    }
  }

  if(robomas_lower_r.state == ROBOMAS_READY && robomas_lower_deg.state == ROBOMAS_READY)return;
  if(!lower_homing_timeout_notified &&
     (robomas_lower_deg.state == ROBOMAS_HOMING || robomas_lower_deg.state == ROBOMAS_IDLE ||
      robomas_lower_r.state   == ROBOMAS_HOMING || robomas_lower_r.state   == ROBOMAS_IDLE) &&
     HAL_GetTick() - lower_homing_start_time > HOMING_LOWER_ARM_TIMEOUT_MS){
    // ROBOMAS_ERROR中の軸はrobomas_update()が管理するのでここでは触らない
    if(robomas_lower_deg.state != ROBOMAS_ERROR)robomas_lower_deg.state = ROBOMAS_INITIAL;
    if(robomas_lower_r.state   != ROBOMAS_ERROR)robomas_lower_r.state   = ROBOMAS_INITIAL;

    lower_homing_timeout_notified = true;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_ERROR_CODE,
      .data.error_code = CAN_ERROR_LOWER_HOMING_TIMEOUT,
    });
  }

  if(robomas_lower_deg.state == ROBOMAS_HOMING && LOWER_ARM_DEG_HOMING_LIMIT_ON){
    robomas_lower_deg.state = ROBOMAS_IDLE;
    // 原点となる偏角はLOWER_ARM_DEG_HOME_DEG(チームに応じてUNDER/OVERどちらの
    // リミットスイッチかで変わる。common/arm/inc/arm.h参照。赤チームは0度なのでオフセット無し)。
    robomas_lower_deg.total_angle_home = robomas_lower_deg.feedback.total_angle
      - LOWER_ARM_DEG_ROBOMAS_DIRECTION * (LOWER_ARM_DEG_HOME_DEG / 360.0) * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION * robomas_lower_deg.gear_ratio;
    pid_reset(&robomas_lower_deg.rpm_pid);
  }
    
  if(robomas_lower_r.state == ROBOMAS_HOMING && LOWER_ARM_R_LIMIT_ON){
    robomas_lower_r.state = ROBOMAS_IDLE;
    robomas_lower_r.total_angle_home = robomas_lower_r.feedback.total_angle - LOWER_ARM_R_ROBOMAS_DIRECTION * LOWER_ARM_R_MIN / (R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION;
    pid_reset(&robomas_lower_r.rpm_pid);
  }

  if(robomas_lower_r.state == ROBOMAS_IDLE && robomas_lower_deg.state == ROBOMAS_IDLE){
    pid_reset(&robomas_lower_r.ang_pid);
    pid_reset(&robomas_lower_deg.ang_pid);
    
    robomas_lower_r.state = ROBOMAS_READY;
    robomas_lower_deg.state = ROBOMAS_READY;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_LOWER_HOMING_DONE,
      .data.homing_sequence = lower_homing_sequence,
    });
    lower_homing_done_ack_pending = true;
    lower_homing_done_sent_time = HAL_GetTick();
    lower_homing_done_retry_count = 0;
    return;
  }
}

double get_r(robomas_t *rb)
{
    double motor_angle =
        rb->feedback.total_angle - rb->total_angle_home;

