nyankowan/CatchRobo_2026/STM32/robomas_controller/Core/Src/main.c
    return LOWER_ARM_R_ROBOMAS_DIRECTION
     * motor_angle
     / ROBOMAS_ANGLE_RESOLUTION
     * (R_ROBOMAS_DIAMETER * M_PI);
}

/**
* @brief ホーミングrpmを目標値svにセットする．
* @return 正常なら引数を返す．異常ならNULL． 
*/
robomas_t *set_robomas_homing_rpm(robomas_t *rb){
  if(rb == &robomas_lower_deg){
    // *_DEG_HOMING_DIRECTION_SIGNは，チームに応じてホーミング先をUNDER/OVERどちらの
    // リミットスイッチにするか(=ROBOT_TEAM)で符号が変わる。DEG_ROBOMAS_DIRECTIONは
    // 配線・機構で決まる固定値。
    rb->rpm_pid.sv = LOWER_ARM_DEG_HOMING_DIRECTION_SIGN * LOWER_ARM_DEG_ROBOMAS_DIRECTION * HOMING_LOWER_DEG_RPM * rb->gear_ratio;
  }else if(rb == &robomas_upper_deg){
    rb->rpm_pid.sv = UPPER_ARM_DEG_HOMING_DIRECTION_SIGN * UPPER_ARM_DEG_ROBOMAS_DIRECTION * HOMING_UPPER_DEG_RPM * rb->gear_ratio;
  }else if(rb == &robomas_lower_r){
    rb->rpm_pid.sv = -LOWER_ARM_R_ROBOMAS_DIRECTION * HOMING_LOWER_R_RPM * rb->gear_ratio;
  }else if(rb == &robomas_upper_r){
    rb->rpm_pid.sv = -UPPER_ARM_R_ROBOMAS_DIRECTION * HOMING_UPPER_R_RPM * rb->gear_ratio;
  }else{return NULL;}
  return rb;
}
/**
* @brief 座標から偏角(度)を計算する．to_polar()の返り値は[0,2π)にラップされるため，
*        可動域がdeg_min~deg_min+180度で360度(=0度)をまたぐ場合(青チームの場合の
*        UPPER_ARM_DEG_MIN+RANGE=360等)，原点付近でdeg=0とdeg=360近辺の値が不連続に
*        切り替わってしまう。deg_min未満なら360度を足し，可動域内で連続な値になるようにする。
*/
static double polar_deg_unwrapped(direct_t d, double deg_min){
  double deg = to_polar(d).theta / (2 * M_PI) * 360.0;
  if(deg < deg_min) deg += 360.0;
  return deg;
}

/**
* @brief 座標に対応するロボマスの角度(一周あたり8192)を座標から計算し，角度目標値svにセットする．
* @return 正常なら引数を返す．異常ならNULL．
**/
robomas_t *set_robomas_deg_from_coordinate(robomas_t *rb){
  if(rb == &robomas_lower_deg){
    rb->ang_pid.sv = LOWER_ARM_DEG_ROBOMAS_DIRECTION * polar_deg_unwrapped(coordinate_lower, LOWER_ARM_DEG_MIN) / 360.0 * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION * rb->gear_ratio;
  }else if(rb == &robomas_lower_r){
    rb->ang_pid.sv = LOWER_ARM_R_ROBOMAS_DIRECTION * to_polar(coordinate_lower).r /(R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION * rb->gear_ratio;
  }else if(rb == &robomas_upper_deg){
    rb->ang_pid.sv = UPPER_ARM_DEG_ROBOMAS_DIRECTION * polar_deg_unwrapped(coordinate_upper, UPPER_ARM_DEG_MIN) / 360.0 * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION * rb->gear_ratio;
  }else if(rb == &robomas_upper_r){
    rb->ang_pid.sv = UPPER_ARM_R_ROBOMAS_DIRECTION * to_polar(coordinate_upper).r /(R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION * rb->gear_ratio;
  }else{return NULL;}
  return rb;
}

/**
* @brief フィードバック途絶によりROBOMAS_ERRORへ遷移した軸を特定するエラーコードを返す．
*/
can_error_t get_lost_control_error_code(robomas_t *rb){
  if(rb == &robomas_lower_r)        return CAN_ERROR_LOWER_R_LOST_CONTROL;
  else if(rb == &robomas_lower_deg) return CAN_ERROR_LOWER_DEG_LOST_CONTROL;
  else if(rb == &robomas_upper_r)   return CAN_ERROR_UPPER_R_LOST_CONTROL;
  else                              return CAN_ERROR_UPPER_DEG_LOST_CONTROL;
}

void robomas_update(robomas_t *rb){
  robomas_state_t prev_state = rb->state;

  if(HAL_GetTick() - rb->feedback.last_update > ROBOMAS_FEEDBACK_TIMEOUT_MS){
    rb->state = ROBOMAS_ERROR;
    if(prev_state != ROBOMAS_ERROR){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_ERROR_CODE,
        .data.error_code = get_lost_control_error_code(rb),
      });
    }
  }else if(rb->state == ROBOMAS_ERROR){
    rb->state = ROBOMAS_INITIAL;
  }

  switch(rb->state){
    case ROBOMAS_HOMING:
      set_robomas_homing_rpm(rb);
      break;

    case ROBOMAS_IDLE:
      rb->rpm_pid.sv = 0;
      break;

    case ROBOMAS_READY:
      set_robomas_deg_from_coordinate(rb);
      rb->ang_pid.pv = rb->feedback.total_angle- rb->total_angle_home;
      rb->rpm_pid.sv = calc_pid(&rb->ang_pid);
      break;

    case ROBOMAS_ERROR:
    case ROBOMAS_INITIAL:
    default:
      rb->tx_torque = 0;
      return;

  }
  rb->rpm_pid.pv = rb->feedback.rpm;
  rb->tx_torque = calc_pid(&rb->rpm_pid);
}

/**
* @brief Status_LEDの点滅を管理する．
*        lower/upperそれぞれがREADY(r軸・deg軸とも)でなければ「未ホーミング」とみなす．
*        lowerのみ未ホーミング:1回点滅 upperのみ:2回点滅 両方:3回点滅 両方READY:常時点灯
*        周期的(mainループ毎)に呼び出すこと．
*/
void status_led_update(){
  bool lower_ready = (robomas_lower_r.state == ROBOMAS_READY && robomas_lower_deg.state == ROBOMAS_READY);
  bool upper_ready = (robomas_upper_r.state == ROBOMAS_READY && robomas_upper_deg.state == ROBOMAS_READY);

  if(lower_ready && upper_ready){
    HAL_GPIO_WritePin(Status_LED_GPIO_Port, Status_LED_Pin, GPIO_PIN_SET);
    status_led_blink_index = 0;
    status_led_on = false;
    status_led_phase_start = HAL_GetTick();
    return;
  }

  uint8_t blink_count = (lower_ready ? 0 : 1) + (upper_ready ? 0 : 2);

  uint32_t now = HAL_GetTick();
  uint32_t elapsed = now - status_led_phase_start;

  if(status_led_on){
    if(elapsed >= STATUS_LED_BLINK_ON_MS){
      HAL_GPIO_WritePin(Status_LED_GPIO_Port, Status_LED_Pin, GPIO_PIN_RESET);
      status_led_on = false;
      status_led_phase_start = now;
      status_led_blink_index++;
    }
  }else{
    bool cycle_done = (status_led_blink_index >= blink_count);
    uint32_t off_duration = cycle_done ? STATUS_LED_BLINK_PAUSE_MS : STATUS_LED_BLINK_OFF_MS;

    if(elapsed >= off_duration){
      if(cycle_done)status_led_blink_index = 0; //一巡したので最初から

      HAL_GPIO_WritePin(Status_LED_GPIO_Port, Status_LED_Pin, GPIO_PIN_SET);
      status_led_on = true;
      status_led_phase_start = now;
    }
  }
}

/*in main roop end*/



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  uint32_t last_heartbeat = HAL_GetTick();
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CAN1_Init();
  MX_CAN2_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */

